{
    "ziwei_auxiliary_stars_detailed": [
        {
            "id": 15,
            "star_name": "左輔星",
            "five_elements": "土",
            "type": "吉星 (助星)",
            "palaces": {
                "命宮": [
                    "個性敦厚樸實，重義氣，不愛出風頭，喜歡居於幕後協助。",
                    "具有優秀的組織與協調能力，能整合資源，人緣極佳。",
                    "耳根子軟，容易心軟而被他人說服，缺乏絕對的主見。"
                ],
                "兄弟宮": [
                    "兄弟姊妹眾多，或手足之間關係緊密，能互相扶持。",
                    "職場同事或合作夥伴是你的貴人，能提供實質助力。",
                    "若遇煞星，可能代表會有異母兄弟或義結金蘭的手足。"
                ],
                "夫妻宮": [
                    "配偶能幹賢慧，能成為你事業上的好幫手。",
                    "婚姻關係穩定，彼此既是伴侶也是戰友，互相尊重。",
                    "若無主星或遇煞，需注意可能有第三者介入（因為『輔』有『多』之意）。"
                ],
                "子女宮": [
                    "子女聰明乖巧，孝順父母，能繼承家業或父母志向。",
                    "與子女關係像朋友般親近，溝通無礙。",
                    "子女較多，或除了親生子女外，有收養或認乾兒女的緣分。"
                ],
                "財帛宮": [
                    "正財運佳，賺錢多靠朋友或合作夥伴的幫助。",
                    "適合透過合夥、仲介或團隊合作來獲利，不宜單打獨鬥。",
                    "財源穩定，雖非暴發，但能積少成多，周轉順利。"
                ],
                "疾厄宮": [
                    "身體健康狀況大致良好，生病時易遇良醫。",
                    "需注意脾胃消化系統，或因應酬過多導致的代謝問題。",
                    "若遇煞星，可能會有結石或良性腫瘤等『多出來』的病灶。"
                ],
                "遷移宮": [
                    "出外運極佳，常常遇到貴人主動幫忙。",
                    "適合往外地發展，容易融入當地環境，不感孤單。",
                    "在外人緣好，發生困難時總有人願意伸出援手。"
                ],
                "交友宮": [
                    "朋友眾多且多為益友，能給你忠誠的建議與幫助。",
                    "部屬得力，忠誠度高，能幫你分憂解勞。",
                    "人際網絡穩固，是事業成功的基石。"
                ],
                "官祿宮": [
                    "適合擔任幕僚、特助、企劃或管理職，輔佐他人成功。",
                    "工作運勢平穩，升遷多得力於同儕的支持或長官的賞識。",
                    "創業適合與人合夥，能互補長短，做大格局。"
                ],
                "田宅宮": [
                    "置產運佳，容易繼承祖產或購買到增值潛力高的房子。",
                    "居住環境良好，鄰居和睦，多為老社區或文教區。",
                    "家運興隆，家人之間凝聚力強，喜歡在家聚會。"
                ],
                "福德宮": [
                    "性情樂觀，知足常樂，精神生活富足。",
                    "晚年生活安逸，有子孫繞膝之福，不感寂寞。",
                    "喜歡參與社團活動或公益事務，從中獲得成就感。"
                ],
                "父母宮": [
                    "父母慈祥，對子女教育開明，關係融洽。",
                    "能得父母或長輩的實質資助，創業或置產較輕鬆。",
                    "父母人緣好，其人脈資源能庇蔭子女。"
                ]
            }
        },
        {
            "id": 16,
            "star_name": "右弼星",
            "five_elements": "水",
            "type": "吉星 (助星)",
            "palaces": {
                "命宮": [
                    "機智靈敏，反應快，擅長隨機應變，比左輔更多了點手段。",
                    "熱心助人，但帶有桃花性質，異性緣特別好。",
                    "喜好自由，有時會有多管閒事的傾向，思緒較為多變。"
                ],
                "兄弟宮": [
                    "兄弟姊妹間感情好，但可能各奔東西，以精神支持為主。",
                    "職場上異性同事或合作夥伴對你助力較大。",
                    "若逢煞星，需防職場桃花糾紛，或被朋友帶去吃喝玩樂。"
                ],
                "夫妻宮": [
                    "配偶聰明有魅力，能幫夫/幫妻，但也容易招惹桃花。",
                    "因為右弼屬水，婚姻中容易有第三者介入，或有二婚之象。",
                    "若能共同經營事業或興趣，可化解感情上的不穩定。"
                ],
                "子女宮": [
                    "子女活潑可愛，反應快，但可能比較調皮。",
                    "與子女關係親密，但也容易因為溺愛而讓孩子依賴。",
                    "可能會有非婚生子女，或再婚帶來的繼子女緣分。"
                ],
                "財帛宮": [
                    "財運亨通，常有兼職或副業收入，財源不只一個。",
                    "適合透過人際關係網、公關或服務業來賺錢。",
                    "對錢財態度較隨性，雖會賺錢但也愛花錢享受。"
                ],
                "疾厄宮": [
                    "注意腎臟、膀胱、內分泌系統或婦科/泌尿科問題。",
                    "容易因為精神壓力大而導致失眠或神經衰弱。",
                    "屬水，生病時病情可能變化較快，需及時就醫。"
                ],
                "遷移宮": [
                    "出外發展機會多，常因貴人引薦而獲得好職缺。",
                    "在外桃花旺，容易發生異地戀情或豔遇。",
                    "適應力強，能快速融入新環境，像水一樣隨遇而安。"
                ],
                "交友宮": [
                    "朋友三教九流皆有，特別容易與異性朋友打成一片。",
                    "能得朋友助力，但也可能因為講義氣而捲入朋友的感情糾紛。",
                    "部屬靈活聰明，但需要花心思管理，避免其過於滑頭。"
                ],
                "官祿宮": [
                    "適合從事服務、公關、傳播、藝術或需頻繁接觸人的行業。",
                    "工作上擅長協調溝通，是解決問題的高手。",
                    "職場生涯中可能會有身兼數職或跨領域發展的現象。"
                ],
                "田宅宮": [
                    "有機會擁有不只一處房產，或房產常變動。",
                    "居家風格講究情調，可能喜歡住在水邊或熱鬧區域。",
                    "若落陷，需注意家中可能有漏水或管線問題。"
                ],
                "福德宮": [
                    "心思細膩，感性浪漫，重視精神享受。",
                    "晚年不甘寂寞，喜歡熱鬧，社交活動頻繁。",
                    "容易因為感情問題而自尋煩惱，情緒起伏較大。"
                ],
                "父母宮": [
                    "父母開明且多才多藝，對你採取放任式教育。",
                    "與父母像朋友一樣相處，無話不談。",
                    "可能會有乾爹乾媽，或由非親生父母撫養長大的情況。"
                ]
            }
        },
        {
            "id": 17,
            "star_name": "天魁星",
            "five_elements": "火",
            "type": "吉星 (陽貴人)",
            "palaces": {
                "命宮": [
                    "天生具有威嚴，相貌堂堂，給人正派可靠的印象。",
                    "一生多得男性長輩或上司的提拔，際遇較順遂。",
                    "個性剛強直率，不喜歡拐彎抹角，有責任感。"
                ],
                "兄弟宮": [
                    "兄弟姊妹中有成就高者，能成為你的榜樣或靠山。",
                    "遇到困難時，兄弟或男性能直接出面幫你解決。",
                    "手足之間感情融洽，互相尊重，少有爭執。"
                ],
                "夫妻宮": [
                    "配偶家世背景不錯，或本身能力強，能與你互補。",
                    "配偶個性較強勢主導，但對家庭責任感重。",
                    "婚姻多由長輩介紹或相親而成，較傳統穩定。"
                ],
                "子女宮": [
                    "子女聰明有貴氣，獨立性強，將來能成大器。",
                    "孩子雖然孝順，但個性較嚴肅，不喜歡撒嬌。",
                    "對子女教育要求高，期望子承父業或出人頭地。"
                ],
                "財帛宮": [
                    "正財運旺，容易獲得長官提拔加薪，或政策性的獲利。",
                    "遇到財務困難時，會有貴人直接金援解圍。",
                    "賺錢途徑多為正當合法的管道，不喜投機。"
                ],
                "疾厄宮": [
                    "身體強健，火氣較旺，需注意心血管或眼部疾病。",
                    "生病時容易遇到名醫或權威醫師治療，恢復快。",
                    "少有慢性病纏身，多為急性病症，來得快去得快。"
                ],
                "遷移宮": [
                    "出外遇貴人，且多為實質上的幫助（如直接給工作）。",
                    "在異地聲望佳，容易獲得當地有力人士的認同。",
                    "適合外出發展，運勢比在家鄉更好。"
                ],
                "交友宮": [
                    "朋友多為社會地位高或年長之人，能提攜你。",
                    "部屬得力且忠誠，能獨當一面，不需要你操心。",
                    "人際交往重質不重量，多為君子之交。"
                ],
                "官祿宮": [
                    "權貴之星，適合公職、大企業或行政管理體系。",
                    "職場上易得長官賞識，升遷速度快，且多擔任要職。",
                    "考試運佳，有利於考取證照或公務員資格。"
                ],
                "田宅宮": [
                    "住家環境氣派，地段好，可能靠近政府機關。",
                    "能繼承祖產，或長輩資助買房。",
                    "鄰居素質高，多為公教人員或有名望之人。"
                ],
                "福德宮": [
                    "精神生活充實，有正氣，不被邪念所擾。",
                    "一生貴人多，遇到挫折總能逢凶化吉，福報深厚。",
                    "晚年受人敬重，享有清譽與社會地位。"
                ],
                "父母宮": [
                    "父母有威嚴，社會地位不錯，對你管教嚴格。",
                    "父親對你的影響力大，是你人生中的第一個貴人。",
                    "與長輩關係良好，能得家族資源庇蔭。"
                ]
            }
        },
        {
            "id": 18,
            "star_name": "天鉞星",
            "five_elements": "火",
            "type": "吉星 (陰貴人)",
            "palaces": {
                "命宮": [
                    "氣質優雅，有人緣，常有異性貴人暗中相助。",
                    "機會常在不經意間出現，適合等待時機，不宜強求。",
                    "個性較為含蓄內斂，帶有桃花性質，易招人喜歡。"
                ],
                "兄弟宮": [
                    "兄弟姊妹感情細膩，女性手足對你幫助較大。",
                    "遇到困難時，會有貴人私下疏通關係幫你解決。",
                    "合作夥伴多為異性，且合作過程愉快順利。"
                ],
                "夫妻宮": [
                    "配偶外貌出眾，氣質佳，可能是你的貴人。",
                    "因帶有桃花性質，需防婚後有異性暗中愛慕。",
                    "另一半對你的幫助多是精神上的支持或私下的建議。"
                ],
                "子女宮": [
                    "子女乖巧聽話，心思細膩，與父母貼心。",
                    "女兒較多或與女兒緣分較深，晚年可享女兒福。",
                    "孩子有藝術天份或獨特才華，不一定走傳統路線。"
                ],
                "財帛宮": [
                    "常有意外之財或暗財，如饋贈、獎金或私房錢。",
                    "適合賺取女性財，或從事美感、藝術相關行業。",
                    "理財方式較低調，財不露白，默默累積財富。"
                ],
                "疾厄宮": [
                    "注意血液循環、內分泌失調或隱疾（不明顯的病）。",
                    "生病時容易遇到女性醫師或護理人員細心照顧。",
                    "身體較為敏感，容易受環境氣候影響而不適。"
                ],
                "遷移宮": [
                    "出外有人緣，常有異性主動提供方便或協助。",
                    "適合夜間活動或從事幕後工作，機會較多。",
                    "在異地容易發生浪漫的際遇，但未必是正緣。"
                ],
                "交友宮": [
                    "朋友多為異性或文藝界人士，交情深厚但不張揚。",
                    "部屬貼心，能注意到細節，幫你處理繁雜瑣事。",
                    "人際關係中有許多看不見的助力在支撐你。"
                ],
                "官祿宮": [
                    "適合從事文化、藝術、美容或秘書等輔助性質工作。",
                    "職場上易得女性長官或主管夫人的提拔。",
                    "工作機會常是透過私下介紹或推薦而來。"
                ],
                "田宅宮": [
                    "居家環境清幽，佈置典雅，注重隱私。",
                    "有機會繼承母系親屬的遺產或房產。",
                    "鄰居多為女性或藝術工作者，相處和睦。"
                ],
                "福德宮": [
                    "心思細膩，重視心靈滿足，喜歡低調的享受。",
                    "一生桃花緣份不斷，老來仍有異性知己相伴。",
                    "信奉宗教或玄學，能從中獲得心靈的平靜。"
                ],
                "父母宮": [
                    "母親對你的影響力大，對你呵護備至。",
                    "與女性長輩緣分深，能得其私下資助或疼愛。",
                    "父母感情良好，家庭氣氛溫馨和諧。"
                ]
            }
        },
        {
            "id": 19,
            "star_name": "文昌星",
            "five_elements": "金",
            "type": "吉星 (文星)",
            "palaces": {
                "命宮": [
                    "眉清目秀，氣質儒雅，聰明好學，邏輯思考強。",
                    "重然諾，講究原則與程序，有時顯得較為刻板。",
                    "文章寫作能力佳，利於升學考試或學術研究。"
                ],
                "兄弟宮": [
                    "兄弟姊妹學歷高或有文藝氣息，相處講理。",
                    "手足之間多以書信或文字溝通，情感較為理性。",
                    "若遇煞星，可能會有文書契約上的糾紛（如擔保）。"
                ],
                "夫妻宮": [
                    "配偶斯文有禮，學歷不錯，重視精神交流。",
                    "婚姻生活平淡但穩定，缺乏激情但細水長流。",
                    "若逢化忌，需注意結婚證書或離婚協議等法律問題。"
                ],
                "子女宮": [
                    "子女聰明好學，成績優異，有文學天份。",
                    "教養方式傾向講道理，重視孩子的學業表現。",
                    "孩子個性較文靜，乖巧聽話，少惹麻煩。"
                ],
                "財帛宮": [
                    "正財為主，靠專業知識、名聲或文字創作生財。",
                    "適合從事補教、出版、法律或會計等專業服務。",
                    "理財保守，帳目分明，不喜歡高風險的投機。"
                ],
                "疾厄宮": [
                    "注意呼吸系統、大腸或肺部問題（金主肺）。",
                    "容易因神經緊張導致失眠或神經衰弱。",
                    "若化忌，需防斑點、痣或手術留下的疤痕影響外觀。"
                ],
                "遷移宮": [
                    "出外有名聲，適合到外地求學或發展專業。",
                    "在外地容易結交書香門第或有學問的朋友。",
                    "運勢平穩，少有大風浪，適合靜態的發展模式。"
                ],
                "交友宮": [
                    "朋友多為同學、同事或學術界人士，素質整齊。",
                    "喜歡以文會友，與朋友討論學術或時事。",
                    "部屬能力強，文書處理精確，能幫你分擔行政工作。"
                ],
                "官祿宮": [
                    "利於科舉考試、公職、學術研究或行政職。",
                    "工作性質多與文件、契約、法規有關，需嚴謹細心。",
                    "職場上靠專業能力晉升，名聲大於權力。"
                ],
                "田宅宮": [
                    "家中藏書多，書香世家，重視書房的佈置。",
                    "居住環境文教氣息濃厚，近學校或圖書館。",
                    "買賣房產過程順利，契約文件清楚，少糾紛。"
                ],
                "福德宮": [
                    "精神生活豐富，喜好閱讀、寫作或靜態休閒。",
                    "思想正統，稍嫌保守，不喜歡過於前衛的事物。",
                    "勞心不勞力，容易為了細節而鑽牛角尖。"
                ],
                "父母宮": [
                    "父母有學問或學歷高，對子女教育極為重視。",
                    "與父母溝通講理，關係客氣有禮，少有肢體衝突。",
                    "父母可能是公教人員或知識份子，家教良好。"
                ]
            }
        },
        {
            "id": 20,
            "star_name": "文曲星",
            "five_elements": "水",
            "type": "吉星 (藝星)",
            "palaces": {
                "命宮": [
                    "口才便給，反應靈敏，具有藝術天份與表演慾。",
                    "感情豐富，帶有桃花，異性緣極佳，易陷情網。",
                    "思維跳躍，不按牌理出牌，適合創意或非正統行業。"
                ],
                "兄弟宮": [
                    "兄弟姊妹多才多藝，感情好，能一起玩樂。",
                    "手足之間可能有金錢借貸關係，需釐清帳目。",
                    "職場上容易遇到能言善道的同事，既是助力也是競爭。"
                ],
                "夫妻宮": [
                    "配偶風趣幽默，多才多藝，極具浪漫情懷。",
                    "婚姻生活充滿情趣，但也容易有桃花介入。",
                    "若化忌，需防因感情問題被騙財，或發生外遇。"
                ],
                "子女宮": [
                    "子女活潑可愛，口才好，有演藝或藝術天份。",
                    "親子關係親密，像朋友一樣打鬧，無代溝。",
                    "孩子較不愛唸死書，需發掘其特殊才藝。"
                ],
                "財帛宮": [
                    "財源廣進，適合靠口才、才藝或表演賺錢。",
                    "偏財運佳，可能有中獎或投資獲利的機會。",
                    "花錢隨性，容易為了興趣或戀愛而大筆揮霍。"
                ],
                "疾厄宮": [
                    "注意腎臟、泌尿系統、水腫或精神性疾病。",
                    "容易有婦科問題（女命）或生殖系統毛病（男命）。",
                    "若化忌，需防口舌是非引起的憂鬱症。"
                ],
                "遷移宮": [
                    "出外有人緣，桃花旺，容易在旅途中發生戀情。",
                    "適合從事演藝、外交或業務工作，靠嘴巴吃飯。",
                    "在外地適應力強，能快速與陌生人打成一片。"
                ],
                "交友宮": [
                    "朋友多為才子佳人，或演藝、娛樂圈人士。",
                    "交友廣闊，但多為吃喝玩樂之交，真心難測。",
                    "容易聽信朋友讒言而誤事，需保持判斷力。"
                ],
                "官祿宮": [
                    "適合演藝、傳播、設計、命理或自由業。",
                    "工作環境活潑多變，不喜歡死板的辦公室。",
                    "職場上靠創意與口才取勝，容易成為團體焦點。"
                ],
                "田宅宮": [
                    "居家環境講究情調，可能會有水景或裝飾品。",
                    "居住地可能靠近商圈、夜市或熱鬧場所。",
                    "買房時容易被外觀吸引而忽略結構問題，需謹慎。"
                ],
                "福德宮": [
                    "思想浪漫，重視精神享受，喜歡幻想。",
                    "桃花重，晚年仍可能有多段感情或豐富社交。",
                    "情緒起伏大，容易因為感情不順而自怨自艾。"
                ],
                "父母宮": [
                    "父母多才多藝，反應快，可能從事特殊行業。",
                    "與父母關係像朋友，溝通輕鬆幽默。",
                    "父母感情可能較為複雜，或曾有第三者介入。"
                ]
            }
        },
        {
            "id": 21,
            "star_name": "祿存星",
            "five_elements": "土",
            "type": "輔星 (財星)",
            "palaces": {
                "命宮": [
                    "個性穩重保守，精打細算，具有理財天賦。",
                    "為人厚道但防衛心強，因為祿存必被擎羊、陀羅夾制。",
                    "一生財運亨通，衣食無憂，但內心常感孤獨壓力。"
                ],
                "兄弟宮": [
                    "兄弟姊妹雖能互助，但金錢帳目分明，較少通財之義。",
                    "手足中有富裕之人，但不一定會直接資助你。",
                    "與同事關係敬而遠之，保護自己不被利用。"
                ],
                "夫妻宮": [
                    "配偶善於理財，帶財入庫，婚後經濟狀況好轉。",
                    "對另一半較為小氣或計較，感情生活缺乏浪漫。",
                    "害怕受傷害，在感情中不敢全心投入，顯得疏離。"
                ],
                "子女宮": [
                    "子女少而精，教育資源集中，孩子將來富有。",
                    "對子女管教嚴格，特別是金錢觀念的培養。",
                    "親子關係較為拘謹，缺乏親密的肢體互動。"
                ],
                "財帛宮": [
                    "真正的財星入庫，積蓄能力極強，只進不出。",
                    "適合從事金融、銀行或穩定收息的投資。",
                    "雖然有錢，但生性節儉，甚至被認為是守財奴。"
                ],
                "疾厄宮": [
                    "身體健康，少病痛，即使生病也容易痊癒。",
                    "注意脾胃消化不良，或因飲食過於精緻而富貴病。",
                    "童年時可能較瘦弱，成年後體態逐漸豐滿。"
                ],
                "遷移宮": [
                    "出外運佳，容易獲得利益，但不喜與人深交。",
                    "適合外出求財，但不宜過度擴張，穩紮穩打為宜。",
                    "在外地行為謹慎，能避開風險，保全自身。"
                ],
                "交友宮": [
                    "朋友多為有錢人或經濟狀況良好者。",
                    "交友謹慎，不輕易借錢給朋友，人際關係較冷淡。",
                    "部屬能力平穩，但忠誠度建立在薪資待遇上。"
                ],
                "官祿宮": [
                    "適合金融、會計、稅務或公職等穩定行業。",
                    "工作表現穩健，不求有功但求無過，職位穩固。",
                    "權力慾不大，注重實質的薪資福利勝過頭銜。"
                ],
                "田宅宮": [
                    "田產豐厚，能繼承祖業且能守成，房產多。",
                    "喜歡堆積物品，家裡東西多，捨不得丟。",
                    "鄰居多為富裕人家，治安良好，環境單純。"
                ],
                "福德宮": [
                    "重視物質享受，認為金錢是安全感的來源。",
                    "生活節儉，但對自己重視的事物捨得花錢。",
                    "內心常擔憂未來，危機意識強，難以真正放鬆。"
                ],
                "父母宮": [
                    "父母經濟狀況良好，能給你優渥的物質生活。",
                    "與父母關係客氣，或許因長輩管教嚴格而有距離。",
                    "能繼承父母的財產或事業基礎。"
                ]
            }
        },
        {
            "id": 22,
            "star_name": "天馬星",
            "five_elements": "火",
            "type": "輔星 (動星)",
            "palaces": {
                "命宮": [
                    "個性活潑好動，閒不下來，喜歡到處跑。",
                    "人生變動大，經常搬家、轉學或換工作。",
                    "若逢吉星（如祿存）為「折鞭馬」，富貴雙全；逢煞為「負屍馬」，勞碌無成。"
                ],
                "兄弟宮": [
                    "兄弟姊妹個性好動，或者常年在外地奔波。",
                    "手足之間聚少離多，聯絡多靠電話或網路。",
                    "兄弟可能是你的旅遊夥伴，或一起從事運輸行業。"
                ],
                "夫妻宮": [
                    "配偶來自遠方，或婚後隨配偶移民、搬家。",
                    "另一半工作性質需常出差，夫妻聚少離多。",
                    "若逢煞星，感情不穩定，容易因遠距離而分手。"
                ],
                "子女宮": [
                    "子女活潑好動，甚至過動，難以安靜坐著。",
                    "孩子長大後會離家發展，出國留學或移民。",
                    "親子相處時間較少，多為動態的互動（如一起運動）。"
                ],
                "財帛宮": [
                    "動中求財，越忙越有錢，適合業務或貿易。",
                    "錢財流動快，賺得快花得也快，難以存死錢。",
                    "適合投資交通運輸、旅遊或國際貿易相關產業。"
                ],
                "疾厄宮": [
                    "注意手腳受傷、跌倒或運動傷害。",
                    "容易流行性感冒或傳染病（來去匆匆的病）。",
                    "女性需注意生理期不順或經痛問題（火氣動盪）。"
                ],
                "遷移宮": [
                    "註定要出外發展，在家鄉難有作為。",
                    "常有出國旅遊、出差或移民的機會，見多識廣。",
                    "在外地活動力強，人脈廣，運勢隨移動而開展。"
                ],
                "交友宮": [
                    "朋友來自五湖四海，國際化的交友圈。",
                    "朋友流動性大，知己難尋，多為過客。",
                    "部屬流動率高，留才不易，需建立標準化流程。"
                ],
                "官祿宮": [
                    "適合外交、旅遊、運輸、物流或外勤業務。",
                    "工作內容多變，需要頻繁出差或調動職位。",
                    "職場上不喜受拘束，適合彈性工時或自由業。"
                ],
                "田宅宮": [
                    "搬家頻繁，難以在一個地方久居。",
                    "房子可能靠近馬路、車站或機場，噪音較大。",
                    "適合投資海外房產，或在異地置產。"
                ],
                "福德宮": [
                    "思想活躍，喜歡求新求變，靜不下來。",
                    "身心忙碌，即使退休了也會找事情做，到處旅遊。",
                    "對於未知的世界充滿好奇，一生都在探索。"
                ],
                "父母宮": [
                    "父母常年在外奔波，或者你早年就離家求學。",
                    "與父母見面時間少，關係較為疏離但無惡意。",
                    "父母個性開明，支持你往外發展。"
                ]
            }
        }
    ]
}