{
    "ziwei_malefic_stars_detailed": [
        {
            "id": 23,
            "star_name": "擎羊星",
            "five_elements": "金",
            "type": "煞星 (刑星)",
            "palaces": {
                "命宮": [
                    "個性剛烈暴躁，好勇鬥狠，但也極具決斷力與衝勁。",
                    "外貌可能有明顯特徵，如傷疤，或容易因意外而動手術。",
                    "人生大起大落，不甘於平凡，是開創型的將才，但易樹敵。"
                ],
                "兄弟宮": [
                    "兄弟姊妹間易有衝突，甚至大打出手，緣分淡薄。",
                    "不宜與手足或朋友合夥，容易因為利益分配不均而鬧翻。",
                    "手足中可能有人受傷、開刀或從事軍警、技術行業。"
                ],
                "夫妻宮": [
                    "夫妻間容易有言語暴力或肢體衝突，溝通火藥味重。",
                    "配偶個性剛強，不願服輸，甚至有「剋夫/剋妻」之嫌。",
                    "閃婚閃離機率高，或經歷生離死別，聚少離多較能化解。"
                ],
                "子女宮": [
                    "子女叛逆，從小難管教，與父母常常對著幹。",
                    "子女身體容易受傷，或出生時需剖腹產。",
                    "雖親情淡薄，但子女獨立性強，將來能靠技術自立。"
                ],
                "財帛宮": [
                    "財運大起大落，有橫發橫破的機會，不適合保守儲蓄。",
                    "適合從事競爭激烈、技術性強或需動刀動剪的行業生財。",
                    "容易因衝動消費或被詐騙而瞬間破財。"
                ],
                "疾厄宮": [
                    "明顯的外傷星，容易有刀傷、車禍、骨折或開刀手術。",
                    "注意頭部、眼部受傷，或羊癲瘋、神經痛等急症。",
                    "身體容易留疤，且復原期間較容易發炎。"
                ],
                "遷移宮": [
                    "出外容易與人起爭執，人際關係緊張，小人多。",
                    "在外地活動力強，但也容易發生意外事故，需注意交通。",
                    "適合往競爭激烈的環境發展，能憑一股狠勁殺出一條血路。"
                ],
                "交友宮": [
                    "容易結交到壞朋友，或具暴力傾向、黑道背景的朋友。",
                    "易受朋友拖累、背叛或肢體傷害，知人知面不知心。",
                    "部屬難以管理，甚至會與上司對抗，職場人際惡劣。"
                ],
                "官祿宮": [
                    "適合軍警、外科醫師、美髮、屠宰或重工業等帶「殺氣」的行業。",
                    "工作極具挑戰性，權力慾強，能在大是非中立功。",
                    "職場競爭激烈，常處於高壓環境，但也因此練就一身本事。"
                ],
                "田宅宮": [
                    "居家附近環境吵雜，可能有工廠、鐵軌或尖銳建築物（刑煞）。",
                    "祖業難守，房產變動大，或買賣過程易有產權糾紛。",
                    "家中裝修容易出問題，或容易受金屬利器破壞。"
                ],
                "福德宮": [
                    "勞碌命，閒不下來，個性急躁，容易自尋煩惱。",
                    "內心充滿不安全感，對現狀不滿，總想著要改變。",
                    "晚年身體多病痛，或因性格剛烈而感到孤獨。"
                ],
                "父母宮": [
                    "與父母溝通困難，常有衝突，早年離家發展較好。",
                    "父母其中一方身體較差，或曾動過大手術。",
                    "家庭教育方式嚴厲，甚至可能有體罰的情況。"
                ]
            }
        },
        {
            "id": 24,
            "star_name": "陀羅星",
            "five_elements": "金",
            "type": "煞星 (忌星)",
            "palaces": {
                "命宮": [
                    "個性固執，猶豫不決，做事喜歡拖泥帶水，像陀螺一樣原地轉。",
                    "心機較深，隱忍不發，容易鑽牛角尖，有冷暴力傾向。",
                    "人生發展較為緩慢，大器晚成，需經歷磨難才能成功。"
                ],
                "兄弟宮": [
                    "兄弟姊妹間關係冷淡，雖住在一起但少交流，甚至互相拖累。",
                    "不宜合夥，容易因為細節問題而在此消彼長中消耗實力。",
                    "手足中有人個性孤僻，或長期患有慢性疾病。"
                ],
                "夫妻宮": [
                    "愛情長跑多年才婚，或婚事一波三折，拖延許久。",
                    "夫妻間常冷戰，有話不說，內心隔閡深，像隱形高牆。",
                    "容易有糾纏不清的爛桃花，剪不斷理還亂。"
                ],
                "子女宮": [
                    "子女個性內向倔強，悶不吭聲，讓父母猜不透。",
                    "生養子女的過程較辛苦，可能會有晚育或難產的現象。",
                    "親子關係疏離，溝通像鬼打牆，難以達成共識。"
                ],
                "財帛宮": [
                    "求財過程辛苦緩慢，賺的是慢錢，難有暴利。",
                    "錢財容易被卡住（如被倒帳、套牢），周轉不靈。",
                    "適合從事研究、加工或需要耐心磨工的行業獲利。"
                ],
                "疾厄宮": [
                    "主慢性病，病程長且難治癒，如風濕、結石、腫瘤。",
                    "注意牙齒不好、骨骼痠痛或先天性體質虛弱。",
                    "容易有潛伏性的疾病，一發現往往已是中晚期。"
                ],
                "遷移宮": [
                    "出外發展不順，容易遇到拖延、誤點或行程受阻。",
                    "在外地適應不良，容易水土不服，或感到孤單。",
                    "人際關係雖無明顯衝突，但難以融入群體，有邊緣化傾向。"
                ],
                "交友宮": [
                    "朋友不多，且多為點頭之交，難以深交。",
                    "容易遇到小人暗中使壞（暗箭），讓你防不勝防。",
                    "部屬辦事效率差，拖拖拉拉，需要你隨時盯著。"
                ],
                "官祿宮": [
                    "適合從事研究、學術、精密工業或需要長時間專注的工作。",
                    "職場升遷緩慢，常受到體制或主管的無形打壓。",
                    "創業初期非常艱辛，需要長時間堅持才能看到成果。"
                ],
                "田宅宮": [
                    "買賣房產過程冗長，容易遇到產權不清的糾紛。",
                    "居家環境陰暗潮濕，或附近有廢墟、垃圾場。",
                    "祖業逐漸凋零，或家中堆滿雜物，清理不易。"
                ],
                "福德宮": [
                    "思慮過多，容易陷入負面情緒無法自拔，有憂鬱傾向。",
                    "一生勞碌，即使沒事做也會找事煩，無法放鬆。",
                    "牙齒大多不好，或有磨牙的習慣，影響睡眠品質。"
                ],
                "父母宮": [
                    "與父母有代溝，溝通困難，感覺被長輩束縛。",
                    "父母可能患有慢性病，需要你長期照顧。",
                    "早年生活環境可能較為壓抑，缺乏家庭溫暖。"
                ]
            }
        },
        {
            "id": 25,
            "star_name": "火星",
            "five_elements": "火",
            "type": "煞星 (暴星)",
            "palaces": {
                "命宮": [
                    "個性剛急，脾氣火爆，像炸藥一樣一點就著，但也去得快。",
                    "做事講求效率，衝動果決，但缺乏耐性與深思熟慮。",
                    "人生際遇突發性強，可能一夜成名，也可能瞬間跌落。"
                ],
                "兄弟宮": [
                    "兄弟姊妹間易有衝突，一言不合就吵架。",
                    "手足多為性急之人，彼此較難和平共處。",
                    "兄弟可能會有意外災傷，或早夭的情況（古代論法）。"
                ],
                "夫妻宮": [
                    "閃電結婚的機率高，一見鍾情，感情來得快去得也快。",
                    "夫妻爭吵激烈，像火災一樣，但吵完可能又沒事。",
                    "配偶個性急躁，缺乏浪漫情趣，生活步調快。"
                ],
                "子女宮": [
                    "子女個性急躁，好動難靜，管教上需要極大的耐心。",
                    "孩子容易發燒、燙傷或有過動傾向。",
                    "雖然親子關係緊張，但子女長大後離家發展反而較好。"
                ],
                "財帛宮": [
                    "有暴發的機會，橫財運佳，但也容易暴敗。",
                    "花錢衝動，沒有計畫，錢財如過路財神。",
                    "適合從事餐飲、能源、電子或高風險投資。"
                ],
                "疾厄宮": [
                    "火氣大，容易有發炎、高燒、燙傷或眼疾。",
                    "注意心血管疾病，或突發性的急症（如中風、心肌梗塞）。",
                    "皮膚容易過敏、長痘，體質燥熱。"
                ],
                "遷移宮": [
                    "出外容易心浮氣躁，發生突發狀況或意外。",
                    "適合往炎熱或熱鬧的地方發展，越動越旺。",
                    "在外地雖有衝勁，但也容易得罪人而不自知。"
                ],
                "交友宮": [
                    "朋友多為性情中人，來往熱絡但缺乏深度。",
                    "容易因朋友的衝動行為而受到波及。",
                    "部屬流動率高，很難留住人才，管理上需速戰速決。"
                ],
                "官祿宮": [
                    "適合需要爆發力、體力或與「火」相關的行業（餐飲、科技）。",
                    "工作效率高，但持續力差，適合專案型任務。",
                    "職場環境競爭激烈，步調快，壓力大。"
                ],
                "田宅宮": [
                    "小心火燭，家中電器容易過熱或引發火災。",
                    "居住環境可能靠近廟宇、變電箱或消防隊。",
                    "祖業難守，可能因突發事件（如投資失敗）而變賣房產。"
                ],
                "福德宮": [
                    "性急心慌，無法靜下來享受生活，總是匆匆忙忙。",
                    "雖然勞碌，但內心充滿熱情，閒不住。",
                    "晚年容易因為急躁而影響健康，需學習修身養性。"
                ],
                "父母宮": [
                    "父母脾氣暴躁，對你缺乏耐心，打罵教育。",
                    "早年可能因為家庭變故（如火災、破產）而離家。",
                    "與父母關係緊張，見面就吵，分開反而想念。"
                ]
            }
        },
        {
            "id": 26,
            "star_name": "鈴星",
            "five_elements": "火",
            "type": "煞星 (暗火)",
            "palaces": {
                "命宮": [
                    "個性陰沈，心思深，脾氣不像火星爆發，而是生悶氣記仇。",
                    "意志力驚人，為了報復或達成目標可以忍耐很久。",
                    "聲音通常較為獨特（如沙啞或尖銳），性格有些孤僻。"
                ],
                "兄弟宮": [
                    "兄弟姊妹間面和心不和，內心有隔閡。",
                    "手足可能在背後說你壞話，或暗中競爭。",
                    "兄弟中有人個性古怪，難以溝通。"
                ],
                "夫妻宮": [
                    "婚姻生活看似平靜，實則暗潮洶湧，冷暴力嚴重。",
                    "配偶個性深沈，心事不願說出來，讓你猜不透。",
                    "容易有長期的感情困擾，或陷入三角關係無法自拔。"
                ],
                "子女宮": [
                    "子女沈默寡言，個性倔強，有事藏心裡。",
                    "管教困難，軟硬不吃，親子關係疏離。",
                    "子女可能會有隱性的健康問題或發育遲緩。"
                ],
                "財帛宮": [
                    "偏財運，常有暗中進財的機會，但不穩定。",
                    "為了錢財可以精算計較，適合賺取需要心機的錢。",
                    "容易因為小錢而與人結怨，或因貪小便宜而吃大虧。"
                ],
                "疾厄宮": [
                    "主虛火，容易有頭痛、偏頭痛、神經衰弱或發燒。",
                    "注意隱性發炎，或慢性病反覆發作，難以斷根。",
                    "皮膚容易乾癢、過敏，或有燒燙傷留下的疤痕。"
                ],
                "遷移宮": [
                    "出外容易遇到陰險小人，被暗算。",
                    "在外地雖能忍辱負重，但內心孤獨感強。",
                    "適合從事需要冷靜觀察或幕後策劃的工作。"
                ],
                "交友宮": [
                    "朋友心機重，多為利益之交，真心朋友少。",
                    "容易被信任的朋友出賣，且往往是在最關鍵的時刻。",
                    "部屬陽奉陰違，表面聽話，背後搞小動作。"
                ],
                "官祿宮": [
                    "適合權謀、幕僚、軍師、徵信或需要保密的行業。",
                    "工作上擅長策劃與分析，但執行力不如火星。",
                    "職場上易捲入派系鬥爭，需懂得明哲保身。"
                ],
                "田宅宮": [
                    "居住環境幽靜但可能陰氣較重，或附近有墳墓、醫院。",
                    "家中容易有噪音干擾（如隔音差），影響安寧。",
                    "買房容易買到有暗病（如漏水修不好）的房子。"
                ],
                "福德宮": [
                    "心胸較狹窄，愛鑽牛角尖，容易記恨讓自己不快樂。",
                    "思慮深沈，喜歡算計，精神壓力大。",
                    "晚年個性孤僻，不喜歡與人往來。"
                ],
                "父母宮": [
                    "父母對你冷淡，或管教方式讓你感到壓抑。",
                    "與父母關係疏遠，即使住在一起也像陌生人。",
                    "父母可能身體不好，有長期的慢性病。"
                ]
            }
        },
        {
            "id": 27,
            "star_name": "地空星",
            "five_elements": "火/空",
            "type": "煞星 (空亡)",
            "palaces": {
                "命宮": [
                    "天馬行空，想像力豐富，不切實際，喜歡幻想。",
                    "與傳統觀念格格不入，適合從事創意、玄學或科技業。",
                    "做事常半途而廢，甚至到頭來一場空，六親緣薄。"
                ],
                "兄弟宮": [
                    "兄弟姊妹緣分極淡，可能各奔東西，少有聯絡。",
                    "手足對你無助力，甚至可能需要你的接濟。",
                    "不宜與兄弟合夥，最後容易因為理念不合而拆夥。"
                ],
                "夫妻宮": [
                    "對感情有獨特見解，不重視世俗條件，重感覺。",
                    "婚姻容易有波折，或配偶婚後事業發展不順。",
                    "容易晚婚，或選擇非傳統的伴侶（如外國人、年齡差距大）。"
                ],
                "子女宮": [
                    "與子女緣分淡，可能少子、無子，或子女早離家。",
                    "子女個性古怪，難以溝通，思想異於常人。",
                    "懷孕期間需注意安胎，容易有流產或難產的風險。"
                ],
                "財帛宮": [
                    "天生的漏財星，對錢財沒概念，花錢如流水。",
                    "不適合經商或投資，容易判斷錯誤而虧損。",
                    "適合從事無本生意、仲介、設計或靠創意賺錢。"
                ],
                "疾厄宮": [
                    "罕見疾病、查不出原因的怪病，或神經系統問題。",
                    "體質較弱，容易氣虛、貧血或精神不濟。",
                    "注意心理健康，容易有憂鬱或恐慌的傾向。"
                ],
                "遷移宮": [
                    "出外容易迷路、掉東西，或發生荒謬的意外。",
                    "在外地常有孤獨感，覺得沒人了解自己。",
                    "適合去沒有人認識的地方重新開始，或從事空中飛人的工作。"
                ],
                "交友宮": [
                    "朋友雖多但無實質助力，多為點頭之交。",
                    "容易遇到奇怪的朋友，或被朋友借錢不還。",
                    "部屬能力平庸，或常常幫倒忙，讓你哭笑不得。"
                ],
                "官祿宮": [
                    "適合創意、發明、科技、玄學、宗教等冷門行業。",
                    "工作變動大，不喜歡受制度約束，適合自由業。",
                    "事業發展起伏不定，常有突發奇想但難以落實。"
                ],
                "田宅宮": [
                    "不易置產，或祖業敗光，最後無殼蝸牛。",
                    "居家環境可能較為空曠、冷清，或附近有荒地。",
                    "買房容易買到有問題的房子（如海砂屋、輻射屋）。"
                ],
                "福德宮": [
                    "淡泊名利，追求精神解脫，第六感強。",
                    "不重物質享受，喜歡鑽研宗教、哲學或神祕學。",
                    "現實生活中常感到空虛，但在精神世界裡是富有的。"
                ],
                "父母宮": [
                    "與父母緣分薄，可能早年分開或父母早逝。",
                    "父母無法提供實質幫助，一切靠自己白手起家。",
                    "對長輩的觀念無法認同，思想代溝大。"
                ]
            }
        },
        {
            "id": 28,
            "star_name": "地劫星",
            "five_elements": "火/劫",
            "type": "煞星 (劫殺)",
            "palaces": {
                "命宮": [
                    "個性衝動，喜歡冒險，做事不顧後果，容易招致失敗。",
                    "人生如同過山車，得而復失，物質生活常感匱乏。",
                    "個性灑脫，但也因為太過大意，常被命運捉弄。"
                ],
                "兄弟宮": [
                    "兄弟姊妹是你的債主，常需為手足背債或收拾爛攤子。",
                    "手足之間會有爭奪家產的現象，親情淡漠。",
                    "兄弟可能會有因意外而受傷或早夭的情況。"
                ],
                "夫妻宮": [
                    "感情路坎坷，容易遇到騙子或利用你的人。",
                    "配偶揮霍無度，會敗光你的財產，或因配偶而負債。",
                    "婚姻中缺乏物質基礎，貧賤夫妻百事哀。"
                ],
                "子女宮": [
                    "子女體質弱，難養育，需花費大量金錢治病。",
                    "孩子敗家，不懂感恩，像討債鬼一樣。",
                    "親子關係緊張，子女長大後可能與父母斷絕往來。"
                ],
                "財帛宮": [
                    "大耗星，錢財留不住，常因意外或被劫而破財。",
                    "投資必賠，千萬不可投機，宜保守存錢。",
                    "錢包常掉，或容易遇到扒手、詐騙集團。"
                ],
                "疾厄宮": [
                    "注意意外傷害、四肢殘缺或器官摘除手術。",
                    "體質較差，免疫力低，容易感染流行性疾病。",
                    "若逢煞星重，需防癌症或重大疾病。"
                ],
                "遷移宮": [
                    "出外如逢強盜，容易遭遇搶劫、偷竊或勒索。",
                    "在外地孤立無援，運勢極差，不宜遠行。",
                    "適合在熟悉的環境發展，保守為上。"
                ],
                "交友宮": [
                    "損友多，專門來劫你的財或利用你的資源。",
                    "容易被朋友詐騙，人財兩失。",
                    "部屬會吃裡扒外，盜取公司機密或捲款潛逃。"
                ],
                "官祿宮": [
                    "工作運途多舛，常面臨公司倒閉或裁員。",
                    "創業十做九敗，不宜投資實體產業。",
                    "適合從事殯葬、拆除、資源回收等「處理廢棄物」的行業。"
                ],
                "田宅宮": [
                    "房產容易被拍賣或抵押，難保祖業。",
                    "居住環境惡劣，可能靠近墳場、垃圾場或治安死角。",
                    "家中容易遭小偷光顧，需加強防盜。"
                ],
                "福德宮": [
                    "內心焦慮，對金錢有極度的不安全感。",
                    "勞碌奔波，為了生存而掙扎，無法享受生活。",
                    "晚年經濟狀況堪憂，需提早規劃養老金。"
                ],
                "父母宮": [
                    "父母經濟狀況差，可能負債，無法給你庇蔭。",
                    "與父母刑剋重，可能因父母拖累而影響前途。",
                    "早年生活困苦，需靠自己打拚。"
                ]
            }
        }
    ]
}